title: Black Basta IP Address Target List
id: 529b4c96-6d32-4bdd-8338-92e7feb3f4cc
status: experimental
description: Detects the file created on an infected endpoint by the Black Basta threat actor containing internal IP addresses used for targeting when deploying ransomware. Typically found on domain controllers.
references:
    - https://research.nccgroup.com/2022/06/06/shining-the-light-on-black-basta/
    - https://unit42.paloaltonetworks.com/threat-assessment-black-basta-ransomware/
author: Aaron Hoffmann
date: 2022/11/21
modified: 2022/11/21
tags:
    - attack.discovery
    - attack.t1016
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFileName: 'pc_list.txt'
        FolderPath|startswith: 'C:\Windows\'
    condition: selection
falsepositives:
     - Unlikely
level: medium