title: Black Basta Ransom Note Creation
id: 3f5ccb4f-b1b9-43d0-aa74-156f8a910d9e
status: experimental
description: Detects creation of the ransom note generated by the Black Basta ransomware
references:
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbasta
author: Aaron Hoffmann
date: 2022/12/05
modified: 2022/12/05
tags:
    - attack.impact
    - attack.t1486
logsource:
    category: file_event
    product: windows
detection:
    selection1:
        - TargetFileName: 'instructions_read_me.txt'
    selection2:
        - TargetFileName: 'read_me.txt'
    selection3:
        - FolderPath|startswith: 'C:\Users\'
    condition: (selection1 OR selection2) AND selection3
falsepositives:
     - Unknown
level: medium