title: Rufus Bootable USB Utility
id: 448ce579-2279-41e0-ab63-e84169b6e918
status: experimental
description: Detects the use of Rufus, a utility used to create bootable USB drives. The threat actor Black Basta has been known to use a droper that mimics the legitimate Rufus software.
references:
    - https://blog.checkpoint.com/2022/10/20/check-point-research-analyzes-the-newly-emerged-black-basta-ransomware-alerts-organizations-to-adopt-prevention-best-practices/
author: Aaron Hoffmann
date: 2022/11/21
modified: 2022/11/21
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        FileName|contains: 'rufus-'
        Process|contains: 'rufus-'
    condition: 1 of selection*
falsepositives:
     - Legitimate administrative activities
level: low