title: Set Black Basta Default Icon Registry Key
id: bed401d0-0cf6-4628-9f13-80a4c6d7b6e6
status: experimental
description: Detects setting the value for the registry key made by Black Basta ransomware that associates an icon with the .basta extension (V1) or the generated 9-character alphanumeric extension (V2) for encrypted files
references:
    - https://research.nccgroup.com/2022/06/06/shining-the-light-on-black-basta/
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbasta
author: Aaron Hoffmann
date: 2022/12/05
modified: 2022/12/05
tags:
    - attack.execution
    - attack.t1112
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: '\SOFTWARE\Classes\'
        TargetObject|endswith: 'DefaultIcon'
        Details:
            - '%\AppData\Local\Temp\fkdjsadasd.ico'
    condition: selection
falsepositives:
     - Unknown
level: high