title: Set Black Basta Wallpaper Registry Key
id: 12ec3551-4aab-4293-bab0-2e3076480591
status: experimental
description: Detects setting the desktop wallpaper registry key to the Black Basta ransom note
references:
    - https://research.nccgroup.com/2022/06/06/shining-the-light-on-black-basta/
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbasta
author: Aaron Hoffmann
date: 2022/12/05
modified: 2022/12/05
tags:
    - attack.impact
    - attack.t1491
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: '\Control Panel\Desktop'
        Details|contains: 'dlaksjdoiwq.jpg'
    condition: selection
falsepositives:
     - Unknown
level: high