// ATT&CK: T1018 - Remote system discovery
// Description: Black Basta has been seen storing IP addresses for targeted systems in C:\windows\pc_list
DeviceFileEvents
| where ActionType == "FileCreated"
| where FolderPath has "c:\\windows\\"
| where FileName has "pc_list"