// ATT&CK: T1486 - Data Encrypted for Impact
// Description: Detects creation of the ransom note generated by the Black Basta ransomware
DeviceFileEvents
| where ActionType == "FileCreated"
| where FolderPath has "c:\\users\\"
| where FileName == "instructions_read_me.txt" or FileName == "read_me.txt"