// ATT&CK: T1486 - Data Encrypted for Impact
// Description: files encrypted by the Black Basta ransomware result in the .basta extension being appended to the original file
DeviceFileEvents
| where ActionType == "FileRenamed"
| where PreviousFileName has_any ('.lnk', '.rtf', '.pst', '.docx', '.xlsx', '.jpg', '.jpeg', '.png', '.pdf')
| where FileName endswith ".basta"
