// ATT&CK: T1486 - Data Encrypted for Impact
// Description: files encrypted by QuantumLocker result in the .qunatum extension being appended to the original file
DeviceFileEvents
| where ActionType == "FileRenamed"
| where PreviousFileName has_any ('.lnk', '.rtf', '.pst', '.docx', '.xlsx', '.jpg', '.jpeg', '.png', '.pdf')
| where FileName endswith ".quantum"
| union (
    DeviceRegistryEvents
    | where ActionType == "RegistryKeyCreated"
    | where RegistryKey contains "HKEY_CURRENT_USER\\SOFTWARE\\Classes\\.quantum\\"
)